src/Catalogs/Подразделения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<Catalog>
		<Properties>
			<Name>Подразделения</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Подсеть</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДиапазоныАдресов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НачальныйАдрес</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонечныйАдрес</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/InformationRegisters/РолиКомпьютеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<InformationRegister>
		<Properties>
			<Name>РолиКомпьютеров</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Назначена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Установлена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕстьОшибки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВыполняемаяОперация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыполняетсяСейчас</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОбновления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Лог</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Компьютер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Компьютеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Роль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РолиКомпьютеров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Catalogs/Компьютеры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<Catalog>
		<Properties>
			<Name>Компьютеры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IP</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АутентификацияОС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияПлатформы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПлатформы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияОС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Память</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Процессор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Разрядность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/Подразделения/Ext/ManagerModule.bsl
Функция СинхронизироватьСРТ() Экспорт
	
	ПараметрыЗапроса = Новый Структура("code, plan, format", "all", "Помагазину", "json");
	ДополнительныеПараметры = Новый Структура("ПараметрыПреобразованияJSON", Новый Структура("ПрочитатьВСоответствие", Ложь));
	Таблица = КоннекторHTTP.PostJson("http://Администратор:1541@srv-rozn-sql:5080/retail/hs/fastex/nodes", ПараметрыЗапроса, ДополнительныеПараметры);
	
	КоличествоНовых = 0;
	КоличествоИзмененных = 0;
	Для каждого Запись Из Таблица Цикл
	
		Ссылка = НайтиПоКоду(СокрЛП(Запись.Код));
		Если Ссылка.Пустая() Тогда
			Подразделение = СоздатьЭлемент();
		Иначе
			Подразделение = Ссылка.ПолучитьОбъект();
		КонецЕсли;
		
		Подразделение.Код = СокрЛП(Запись.Код);
		Подразделение.Наименование = СокрЛП(Запись.Наименование);
		Подразделение.Подсеть = ПолучитьПодсетьИзIP(Запись.IP);
		Подразделение.Записать();
		
		Компьютер = Справочники.Компьютеры.НайтиПоКоду(Подразделение.Код);
		Если НЕ Компьютер.Пустая() Тогда
			Компьютер = Компьютер.ПолучитьОбъект();
			Если ПустаяСтрока(Компьютер.IP) ИЛИ Компьютер.IP = "?" Тогда
				Компьютер.IP = СокрЛП(АдресПодсети(Запись.IP, 2));
			КонецЕсли;
		Иначе
			Компьютер = Справочники.Компьютеры.СоздатьЭлемент();
			Компьютер.Наименование = "???";
			КоличествоНовых = КоличествоНовых + 1;
			Компьютер.IP = СокрЛП(АдресПодсети(Запись.IP, 2));
		КонецЕсли;
		Компьютер.Код = Подразделение.Код;
		Компьютер.Подразделение = Подразделение.Ссылка;
		Компьютер.Записать();
		РегистрыСведений.РолиКомпьютеров.Назначить(Компьютер.Ссылка, "Apache");
		РегистрыСведений.РолиКомпьютеров.Назначить(Компьютер.Ссылка, "Клиент 1С");
	
		ИБ = Справочники.ИнформационныеБазы.НайтиПоКоду(Подразделение.Код);
		Если НЕ ИБ.Пустая() Тогда
			ИБ = ИБ.ПолучитьОбъект();
		Иначе
			ИБ = Справочники.ИнформационныеБазы.СоздатьЭлемент();
		КонецЕсли;
		ИБ.Код = Подразделение.Код;
		ИБ.Наименование = "РТ, " + Подразделение.Наименование;
		ИБ.Компьютер = Компьютер.Ссылка;
		Если ПроверкаИзмененности.ОбъектИзменен(ИБ) Тогда
			Если НЕ ИБ.ЭтоНовый() Тогда
				КоличествоИзмененных = КоличествоИзмененных + 1;
			КонецЕсли;
			ИБ.Записать();
		КонецЕсли;
	
	КонецЦикла;
	
	Сообщить(СтрШаблон("Новых: %1, измененных: %2", КоличествоНовых, КоличествоИзмененных));
	
КонецФункции
 
Функция ПолучитьПодсетьИзIP(Знач IP)
	Возврат АдресПодсети(IP, "0");
КонецФункции

Функция АдресПодсети(Знач IP, Номер)

	IP = СокрЛП(СтрЗаменить(IP, " ", ""));
	Позиция = СтрНайти(IP, ".", , , 3);
	Если Позиция > 0 Тогда
		IP = Лев(IP, Позиция) + Номер;	
	КонецЕсли;
	
	Возврат IP;

КонецФункции
